# InfillCannotHaveDiffThickness Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InfillFailures..::..InfillCannotHaveDiffThickness Property
BuiltInFailures..::..InfillFailures Class See Also
---
This infilling element must have the same thickness as its host.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InfillCannotHaveDiffThickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InfillCannotHaveDiffThickness As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InfillCannotHaveDiffThickness {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..InfillFailures Class
Autodesk.Revit.DB Namespace